app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
	def index
		# get all creatures from db and save to instance variable
		@creatures = Creature.all

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
---
  	def show
   	 # get the creature id from the url params
    	creature_id = params[:id]

    	# use 'creature_id' to find the creature in the database
    	# and save it to an instance variable
    	@creature = Creature.find_by_id(creature_id)

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["description", "dsaf"], ["created_at", "2016-01-09 22:58:34.462997"], ["updated_at", "2016-01-09 22:58:34.462997"]]
---
	def create
		# whitelist params and save them to a variable
		creature_params = params.require(:creature).permit(:name, :description)

		# create a new creature from 'creature_params'
		creature = Creature.new(creature_params)

		# if creature saves, redirect to route that displays all creatures
		if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
---
  	def edit
    	# get the creature id from the url params
    	creature_id = params[:id]

    	# use `creature_id` to find the creature in the database
    	# and save it to an instance variable
    	@creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["name", "ObiWan Kenobi"], ["description", "Jedi Master"], ["updated_at", "2016-01-10 23:19:16.002304"], ["id", 11]]
---
  	def update
	    # get the creature id from the url params
	    creature_id = params[:id]

	    # use `creature_id` to find the creature in the database
	    # and save it to an instance variable
	    creature = Creature.find_by_id(creature_id)

	    # whitelist params and save them to a variable
	    creature_params = params.require(:creature).permit(:name, :description)

	    # update the creature
	    creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 4]]
---
  	def destroy
    	# get the creature id from the url params
    	creature_id = params[:id]

    	# use `creature_id` to find the creature in the database
    	# and save it to an instance variable
    	creature = Creature.find_by_id(creature_id)

    	# destroy the creature
    	creature.destroy